'use client'
import { useEffect, useRef, useState } from "react";
import { gsap } from "gsap";
import { ScrollTrigger } from "gsap/ScrollTrigger";
import Image from "next/image";

gsap.registerPlugin(ScrollTrigger);

const Footer = () => {
    const [coords, setCoords] = useState({ x: 0, y: 0 });
    const [isHovered, setIsHovered] = useState(false);
    const buttonRef = useRef<HTMLButtonElement>(null);
    const [hasAppeared, setHasAppeared] = useState('');
    const [errors, setErrors] = useState<{ name?: string; phone?: string; email?: string }>({});
    const [submitted, setSubmitted] = useState(false);

    const validate = (form: HTMLFormElement & {
        name: { value: string };
        phone: { value: string };
        email: { value: string };
    }) => {
        const name = form.name.value.trim();
        const phone = form.phone.value.trim();
        const email = form.email.value.trim();
    
        const newErrors: typeof errors = {};
    
        // Валидация имени (только буквы, без цифр и спецсимволов)
        if (!/^[A-Za-zА-Яа-яЁё\s]+$/.test(name)) {
          newErrors.name = 'Имя должно содержать только буквы';
        }
    
        // Валидация телефона (строго по маске)
        if (!/^\+7 \(\d{3}\) \d{3} \d{2} \d{2}$/.test(phone)) {
          newErrors.phone = 'Введите номер в формате +7 (999) 999 99 99';
        }
    
        // Валидация email
        if (!/^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(email)) {
          newErrors.email = 'Введите корректный email';
        }
    
        setErrors(newErrors);
        return Object.keys(newErrors).length === 0;
    };
    
    const handleSubmit = (e: React.FormEvent<HTMLFormElement>) => {
        e.preventDefault();
        const form = e.currentTarget as HTMLFormElement & {
            name: { value: string };
            phone: { value: string };
            email: { value: string };
          };
    
        if (validate(form)) {
          const data = {
            name: form.name.value,
            phone: form.phone.value,
            email: form.email.value,
          };
          console.log('Данные отправлены:', data);
          setSubmitted(true);
          form.reset();
        }
    };
    
    const handlePhoneInput = (e: React.FormEvent<HTMLInputElement>) => {
        let value = e.currentTarget.value.replace(/\D/g, ''); // удаляем всё, кроме цифр
      
        // Убираем ведущую 8 или 7 (если пользователь её ввёл)
        if (value.startsWith('8')) value = value.slice(1);
        if (value.startsWith('7')) value = value.slice(1);
      
        // Ограничиваем длину 10 цифрами после +7
        if (value.length > 10) value = value.slice(0, 10);
      
        let formatted = '+7';
      
        if (value.length > 0) {
          formatted += ' (' + value.slice(0, 3);
        }
        if (value.length >= 4) {
          formatted += ') ' + value.slice(3, 6);
        }
        if (value.length >= 7) {
          formatted += ' ' + value.slice(6, 8);
        }
        if (value.length >= 9) {
          formatted += ' ' + value.slice(8, 10);
        }
      
        e.currentTarget.value = formatted;
    };
      
    const handleNameInput = (e: React.ChangeEvent<HTMLInputElement>) => {
        const value = e.target.value;
      
        // Оставляем только буквы (латиница и кириллица)
        const cleanValue = value.replace(/[^a-zA-Zа-яА-ЯёЁ]/g, '');
      
        e.target.value = cleanValue;
    };
    

    const handleMouseMove = (e: React.MouseEvent) => {
        if (!buttonRef.current) return;
        const rect = buttonRef.current.getBoundingClientRect();
        setCoords({
            x: e.clientX - rect.left,
            y: e.clientY - rect.top,
        });
    };
    useEffect(() => {
        const threshold = 0.92; // 50% от высоты страницы
    
        const handleScroll = () => {
          const scrollPosition = window.scrollY;
          const documentHeight = document.documentElement.scrollHeight;
          const windowHeight = window.innerHeight;
    
          const scrollPercent = scrollPosition / (documentHeight - windowHeight);
    
          // Когда прокрутка достигает порога (threshold), показываем элемент
          if (scrollPercent >= threshold) {
            setHasAppeared("bgActive")
          } else {
            setHasAppeared("bgNone")
          }
        };
    
        window.addEventListener('scroll', handleScroll);
    
        // Очистка слушателя событий при размонтировании
        return () => window.removeEventListener('scroll', handleScroll);
      }, [hasAppeared]);
    return (
        <div className={`footer`} >
            <div className={`footerBg ${hasAppeared}`}>
                <Image src={'/image/footer-gradient.webp'} className={`animateElement`} alt="footerBg" width={1440} height={300} />
            </div>
            <h1 className="footer_title">
                hello@functionaldesign.studio
            </h1>
            <div className="contact_via">
                <p>Contact via Messenger:</p>
                <div className="contact_via_icon">
                    <div className="icon">
                        <svg width="35" height="35" viewBox="0 0 35 35" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <g clipPath="url(#clip0_1641_726)">
                        <path d="M32.3992 26.6734C34.0423 24.002 34.9899 20.8669 34.9899 17.5C35 7.83266 27.1673 0 17.5 0C7.83266 0 0 7.83266 0 17.5C0 27.1673 7.83266 35 17.5 35C20.8669 35 24.002 34.0524 26.6734 32.4093L35 35L32.4093 26.6734H32.3992ZM13.3669 21.6331C8.60887 16.875 8.64919 12.6714 9.18347 11.2601C9.70766 9.85887 11.0786 8.94153 11.4113 8.94153C11.744 8.94153 12.2278 8.96169 12.6512 8.99194C13.0746 9.02218 13.3266 9.20363 13.5685 9.81855C13.8004 10.4335 14.4153 12.127 14.6976 12.8831C14.9798 13.6391 14.879 13.7903 14.7177 14.1129C14.5565 14.4355 13.9214 15.131 13.5887 15.4738C13.246 15.8165 13.3065 16.0383 13.4476 16.4113C13.5887 16.7843 14.7177 18.4677 15.625 19.375C16.5323 20.2823 18.2157 21.4113 18.5887 21.5524C18.9617 21.6935 19.1835 21.754 19.5262 21.4113C19.869 21.0685 20.5645 20.4335 20.8871 20.2823C21.2097 20.131 21.3609 20.0202 22.1169 20.3024C22.873 20.5847 24.5565 21.1996 25.1815 21.4315C25.7964 21.6633 25.9879 21.9153 26.0081 22.3488C26.0383 22.7722 26.0484 23.256 26.0585 23.5887C26.0585 23.9214 25.1512 25.2923 23.7399 25.8165C22.3387 26.3407 18.125 26.3911 13.3669 21.6331Z" fill="currentColor"/>
                        </g>
                        <defs>
                        <clipPath id="clip0_1641_726">
                        <rect width="35" height="35" fill="white"/>
                        </clipPath>
                        </defs>
                        </svg>
                    </div>
                    <span>WhatsApp</span>
                </div>
                <div className="contact_via_icon">
                    <div className="icon">
                        <svg width="35" height="35" viewBox="0 0 35 35" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <g clipPath="url(#clip0_1641_724)">                        
                            <path d="M17.5 0C7.83266 0 0 7.83266 0 17.5C0 27.1673 7.83266 35 17.5 35C27.1673 35 35 27.1673 35 17.5C35 7.83266 27.1673 0 17.5 0ZM26.3206 10.8871C25.9375 12.6915 25.5544 14.506 25.1613 16.3105C24.7177 18.377 24.2843 20.4536 23.8407 22.5202C23.5887 23.6996 23.3468 24.869 23.0847 26.0484C23.0343 26.2601 22.9738 26.4819 22.873 26.6734C22.6613 27.1169 22.3085 27.2782 21.8246 27.1472C21.5726 27.0766 21.3306 26.9657 21.119 26.8044C19.8891 25.8871 15.8266 22.873 13.4677 21.119C13.4778 21.0786 13.498 21.0282 13.5282 21.0081C16.2298 18.5383 18.9314 16.0585 21.6431 13.5887C21.9254 13.3266 22.2177 13.0645 22.5 12.8024C22.5504 12.752 22.6008 12.6915 22.6411 12.631C22.6915 12.5403 22.6613 12.4698 22.5706 12.4294C22.4294 12.379 22.2883 12.3992 22.1573 12.4597C22.0565 12.5101 21.9657 12.5706 21.8649 12.631C18.377 14.8286 14.879 17.0262 11.3911 19.2238C11.1996 19.3448 10.998 19.4657 10.8065 19.5867C10.746 19.627 10.6956 19.6371 10.6351 19.6069C9.0625 19.123 7.47984 18.6391 5.90726 18.1552C5.74597 18.1048 5.58468 18.0645 5.43347 17.9839C5.10081 17.8226 5.04032 17.5504 5.23185 17.2278C5.35282 17.0363 5.53427 16.9052 5.73589 16.8246C6.21976 16.623 6.70363 16.4214 7.1875 16.2399C10.1915 15.0806 13.1956 13.9214 16.1996 12.7621C19.1028 11.6431 22.0161 10.5141 24.9194 9.39516C25.0504 9.34476 25.1915 9.31452 25.3226 9.28427C25.8871 9.19355 26.25 9.67742 26.3306 10.0605C26.381 10.3327 26.3609 10.5948 26.3004 10.8569L26.3206 10.8871Z" fill="currentColor"/>
                        </g>
                        <defs>                        
                            <clipPath id="clip0_1641_724">
                            <rect width="35" height="35" fill="white"/>
                            </clipPath>
                        </defs>
                        </svg>
                    </div>
                    <span>Telegram</span>
                </div>
            </div>
            <div className="footer_form">
                <h1>Order <br className="br"/> a service</h1>
                <form className="Fform" onSubmit={handleSubmit} >
                    <input name="name"   onInput={handleNameInput} required type="text" placeholder="Name"/>
                    <input name="phone" onInput={handlePhoneInput} required type="tel" placeholder="+7 (XXX) XXX XX XX"/>
                    <input required type="email" placeholder="Email"/>
                    <div className="footer_buttons">
                        <button
                            ref={buttonRef}
                            value="Submit"
                            onMouseMove={handleMouseMove}
                            onMouseEnter={() => setIsHovered(true)}
                            onMouseLeave={() => setIsHovered(false)}
                            className="relative max-[769px]:min-w-[73px] min-w-[112px] max-[769px]:text-[14px] max-[769px]:py-[2px] max-[769px]:px-5 overflow-hidden rounded-full text-[var(--background)] bg-[var(--white-color)] px-[30px] py-[10px] text-[22px] leading-[34px]"
                        >
                            <span
                                className="absolute w-19 h-19 bg-[var(--orenge-color)] rounded-full transition-all duration-500 ease-out"
                                style={{
                                    top: coords.y,
                                    left: coords.x,
                                    transform: `translate(-50%, -50%) scale(${isHovered ? 3 : 0})`,
                                    opacity: isHovered ? 1 : 0,
                                    pointerEvents: 'none',
                                    zIndex: 0,
                                }}
                            />
                            <span className="relative z-10">
                                Send
                            </span>
                        </button>
                        <p>By clicking on the «Send» button, I consent to the processing of personal data</p>
                    </div>
                </form>
            </div>
            <div className="discover">
                <div className="links">
                    <p>Discover our work on:</p>
                    <div className="icon">
                        <svg width="35" height="35" viewBox="0 0 25 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M12.5 2.25149C15.8352 2.25149 16.2369 2.26084 17.5542 2.32623C18.778 2.38229 19.432 2.58782 19.8804 2.75598C20.4596 2.98019 20.88 3.25112 21.3191 3.69021C21.7582 4.1293 22.0291 4.54036 22.2534 5.12892C22.4215 5.56801 22.6271 6.23132 22.6831 7.45516C22.7392 8.77242 22.7578 9.17414 22.7578 12.5093C22.7578 15.8445 22.7485 16.2463 22.6831 17.5635C22.6271 18.7874 22.4215 19.4413 22.2534 19.8898C22.0291 20.469 21.7582 20.8894 21.3191 21.3285C20.88 21.7676 20.469 22.0385 19.8804 22.2627C19.4413 22.4309 18.778 22.6364 17.5542 22.6925C16.2369 22.7485 15.8445 22.7672 12.5 22.7672C9.15546 22.7672 8.76308 22.7578 7.44581 22.6925C6.22197 22.6364 5.56801 22.4309 5.11958 22.2627C4.54036 22.0385 4.11996 21.7676 3.68087 21.3285C3.24178 20.8894 2.97085 20.4783 2.74664 19.8898C2.57848 19.4507 2.37294 18.7874 2.31689 17.5635C2.26084 16.2463 2.24215 15.8445 2.24215 12.5093C2.24215 9.17414 2.25149 8.77242 2.31689 7.45516C2.37294 6.23132 2.57848 5.57735 2.74664 5.12892C2.97085 4.5497 3.24178 4.1293 3.68087 3.69021C4.11996 3.25112 4.53102 2.98019 5.11958 2.75598C5.55867 2.58782 6.22197 2.38229 7.44581 2.32623C8.76308 2.27018 9.1648 2.25149 12.5 2.25149ZM12.5 0C9.0994 0 8.679 0.0186846 7.34305 0.0747384C6.0071 0.140135 5.1009 0.345665 4.3068 0.653961C3.48468 0.971599 2.78401 1.40135 2.09268 2.09268C1.40135 2.78401 0.971599 3.48468 0.653961 4.3068C0.345665 5.1009 0.130792 6.0071 0.0747384 7.34305C0.00934231 8.679 0 9.0994 0 12.5C0 15.9006 0.0186846 16.321 0.0747384 17.6569C0.140135 18.9929 0.345665 19.8991 0.653961 20.6932C0.971599 21.5153 1.40135 22.216 2.09268 22.9073C2.78401 23.5987 3.48468 24.0284 4.3068 24.346C5.1009 24.6543 6.0071 24.8692 7.34305 24.9253C8.679 24.9907 9.0994 25 12.5 25C15.9006 25 16.321 24.9813 17.6569 24.9253C18.9929 24.8599 19.8991 24.6543 20.6932 24.346C21.5153 24.0284 22.216 23.5987 22.9073 22.9073C23.5987 22.216 24.0284 21.5153 24.346 20.6932C24.6543 19.8991 24.8692 18.9929 24.9253 17.6569C24.9907 16.321 25 15.9006 25 12.5C25 9.0994 24.9813 8.679 24.9253 7.34305C24.8599 6.0071 24.6543 5.1009 24.346 4.3068C24.0284 3.48468 23.5987 2.78401 22.9073 2.09268C22.216 1.40135 21.5153 0.971599 20.6932 0.653961C19.8991 0.345665 18.9929 0.130792 17.6569 0.0747384C16.321 0.0093423 15.9006 0 12.5 0Z" fill="currentColor"/>
                        <path d="M12.4963 6.07812C8.94621 6.07812 6.07812 8.95555 6.07812 12.4963C6.07812 16.037 8.95555 18.9144 12.4963 18.9144C16.037 18.9144 18.9144 16.037 18.9144 12.4963C18.9144 8.95555 16.037 6.07812 12.4963 6.07812ZM12.4963 16.6723C10.1981 16.6723 8.32962 14.8038 8.32962 12.5056C8.32962 10.2074 10.1981 8.33896 12.4963 8.33896C14.7945 8.33896 16.663 10.2074 16.663 12.5056C16.663 14.8038 14.7945 16.6723 12.4963 16.6723Z" fill="currentColor"/>
                        <path d="M19.1682 7.32853C19.9989 7.32853 20.6723 6.65512 20.6723 5.82442C20.6723 4.99373 19.9989 4.32031 19.1682 4.32031C18.3375 4.32031 17.6641 4.99373 17.6641 5.82442C17.6641 6.65512 18.3375 7.32853 19.1682 7.32853Z" fill="currentColor"/>
                        </svg>
                    </div>
                    <div className="icon">
                        <svg width="35" height="35" viewBox="0 0 25 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M8.31148 13.6094H5.78906V15.8515H8.27412C10.5443 15.8515 10.4042 13.6094 8.31148 13.6094Z" fill="currentColor"/>
                        <path d="M8.23369 9.15625H5.80469V11.3891H8.46724C10.3357 11.3891 10.6253 9.15625 8.23369 9.15625Z" fill="currentColor"/>
                        <path d="M17.342 11.2188C16.2489 11.2188 15.651 11.7886 15.4922 12.8723H19.1824C19.1077 11.7232 18.3416 11.2188 17.342 11.2188Z" fill="currentColor"/>
                        <path d="M24.9253 7.34305C24.8599 6.01644 24.6543 5.1009 24.346 4.3068C24.0284 3.48468 23.5987 2.78401 22.9073 2.09268C22.216 1.40135 21.5153 0.971599 20.6932 0.653961C19.8991 0.345665 18.9929 0.130792 17.6569 0.0747384C16.321 0.00934231 15.9006 0 12.5 0C9.0994 0 8.679 0.0186846 7.34305 0.0747384C6.0071 0.140135 5.1009 0.345665 4.3068 0.653961C3.48468 0.971599 2.78401 1.40135 2.09268 2.09268C1.40135 2.78401 0.971599 3.48468 0.653961 4.3068C0.345665 5.1009 0.130792 6.0071 0.0747384 7.34305C0.0093423 8.679 0 9.0994 0 12.5C0 15.9006 0.0186846 16.321 0.0747384 17.6569C0.130792 18.9836 0.345665 19.8991 0.653961 20.6932C0.971599 21.5153 1.40135 22.216 2.09268 22.9073C2.78401 23.5987 3.48468 24.0284 4.3068 24.346C5.1009 24.6543 6.0071 24.8692 7.34305 24.9253C8.679 24.9907 9.0994 25 12.5 25C15.9006 25 16.321 24.9813 17.6569 24.9253C18.9929 24.8599 19.8991 24.6543 20.6932 24.346C21.5153 24.0284 22.216 23.5987 22.9073 22.9073C23.5987 22.216 24.0284 21.5153 24.346 20.6932C24.6543 19.8991 24.8692 18.9929 24.9253 17.6569C24.9907 16.321 25 15.9006 25 12.5C25 9.0994 24.9813 8.679 24.9253 7.34305ZM8.3707 18.068H3.56876V6.94133H8.73505C12.8083 6.99738 12.883 10.9865 10.753 12.0703C13.3221 13.0045 13.4155 18.0587 8.3707 18.0587V18.068ZM14.7141 6.92265H19.9178V8.40807H14.7141V6.92265ZM21.4032 14.3311H15.4335C15.5269 16.7134 18.0213 16.7975 18.8434 15.8352H21.1977C20.8707 16.7975 19.6936 18.068 17.4047 18.068C15.1158 18.068 13.2661 16.7788 13.2661 13.8453C13.2661 10.9118 14.9944 9.44507 17.33 9.44507C19.6655 9.44507 21.0202 10.7717 21.3285 12.7336C21.3845 13.1073 21.4126 13.6211 21.4032 14.3217V14.3311Z" fill="currentColor"/>
                        </svg>
                    </div>
                    <div className="icon">
                        <svg width="35" height="35" viewBox="0 0 25 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M9.75501 14.132C10.9415 13.1604 12.0906 12.5532 13.221 12.3009C13.0528 11.8992 12.8847 11.5442 12.7259 11.2266C10.764 11.8525 8.65262 12.1608 6.3731 12.1608C5.92467 12.1608 5.59769 12.1608 5.38281 12.1421C5.38281 12.1888 5.38281 12.2449 5.38281 12.3103C5.38281 12.3757 5.38281 12.4317 5.38281 12.4784C5.38281 14.2535 5.98072 15.823 7.17653 17.1683C7.71839 16.0939 8.58722 15.0756 9.77369 14.1133L9.75501 14.132Z" fill="currentColor"/>
                        <path d="M10.4964 15.2034C9.43139 16.1282 8.64664 17.0905 8.13281 18.1088C9.42205 19.1084 10.8701 19.6129 12.4863 19.6129C13.3271 19.6129 14.1679 19.4541 14.9994 19.1365C14.7752 17.1933 14.3268 15.3061 13.6635 13.4844C12.6171 13.7086 11.5614 14.2878 10.4964 15.2127V15.2034Z" fill="currentColor"/>
                        <path d="M17.0358 7.0099C15.7186 5.91685 14.2051 5.375 12.4955 5.375C11.9163 5.375 11.337 5.45908 10.7578 5.6179C11.7574 6.6549 12.6823 7.94413 13.5418 9.49496C15.0926 8.85034 16.2604 8.01887 17.0452 7.01925L17.0358 7.0099Z" fill="currentColor"/>
                        <path d="M12.1225 10.0037C11.2537 8.47161 10.3101 7.19172 9.27309 6.16406C8.37623 6.62184 7.60081 7.24777 6.9562 8.06055C6.31158 8.86399 5.86315 9.76085 5.60156 10.7418C5.8538 10.7605 6.21815 10.7792 6.7133 10.7792C8.60978 10.7792 10.4128 10.5269 12.1225 10.0131V10.0037Z" fill="currentColor"/>
                        <path d="M15.1562 13.2794C15.7355 14.961 16.1278 16.6893 16.3334 18.4644C17.2302 17.8851 17.9683 17.1378 18.5382 16.2316C19.108 15.3254 19.4444 14.3351 19.5658 13.2794C18.7344 13.2233 17.9776 13.1953 17.2956 13.1953C16.6697 13.1953 15.9597 13.2233 15.1656 13.2794H15.1562Z" fill="currentColor"/>
                        <path d="M24.9253 7.34305C24.8599 6.0071 24.6543 5.1009 24.346 4.3068C24.0284 3.48468 23.5987 2.78401 22.9073 2.09268C22.216 1.40135 21.5153 0.971599 20.6932 0.653961C19.8991 0.345665 18.9929 0.130792 17.6569 0.0747384C16.321 0.00934231 15.9006 0 12.5 0C9.0994 0 8.679 0.0186846 7.34305 0.0747384C6.01644 0.140135 5.1009 0.345665 4.3068 0.653961C3.48468 0.971599 2.78401 1.40135 2.09268 2.09268C1.40135 2.78401 0.971599 3.48468 0.653961 4.3068C0.345665 5.1009 0.130792 6.0071 0.0747384 7.34305C0.0093423 8.679 0 9.0994 0 12.5C0 15.9006 0.0186846 16.321 0.0747384 17.6569C0.130792 18.9929 0.345665 19.8991 0.653961 20.6932C0.971599 21.5153 1.40135 22.216 2.09268 22.9073C2.78401 23.5987 3.48468 24.0284 4.3068 24.346C5.1009 24.6543 6.0071 24.8692 7.34305 24.9253C8.679 24.9907 9.0994 25 12.5 25C15.9006 25 16.321 24.9813 17.6569 24.9253C18.9929 24.8599 19.8991 24.6543 20.6932 24.346C21.5153 24.0284 22.216 23.5987 22.9073 22.9073C23.5987 22.216 24.0284 21.5153 24.346 20.6932C24.6543 19.8991 24.8692 18.9929 24.9253 17.6569C24.9907 16.321 25 15.9006 25 12.5C25 9.0994 24.9813 8.679 24.9253 7.34305ZM19.8804 16.7881C19.1143 18.096 18.0867 19.133 16.7694 19.8991C15.4615 20.6652 14.0321 21.0389 12.4813 21.0389C10.9305 21.0389 9.50112 20.6558 8.1932 19.8991C6.88528 19.133 5.84828 18.1054 5.08221 16.7881C4.31614 15.4802 3.94245 14.0508 3.94245 12.5C3.94245 10.9492 4.32549 9.5198 5.08221 8.21188C5.84828 6.90396 6.87593 5.86696 8.1932 5.1009C9.50112 4.33483 10.9305 3.96114 12.4813 3.96114C14.0321 3.96114 15.4615 4.34417 16.7694 5.1009C18.0774 5.86696 19.1143 6.89462 19.8804 8.21188C20.6465 9.5198 21.0202 10.9492 21.0202 12.5C21.0202 14.0508 20.6371 15.4802 19.8804 16.7881Z" fill="currentColor"/>
                        <path d="M14.1484 10.7042C14.3166 11.0685 14.5128 11.5263 14.7277 12.0868C15.5685 12.0028 16.484 11.9654 17.4743 11.9654C18.1843 11.9654 18.8756 11.9841 19.5763 12.0121C19.4829 10.4613 18.9317 9.08797 17.904 7.88281C17.166 8.9852 15.9141 9.92878 14.1484 10.6948V10.7042Z" fill="currentColor"/>
                        </svg>
                    </div>
                </div>
                <p>© Functional Design Studio. All rights reserved</p>
            </div>
        </div>
    )
}

export default Footer